In [4]:
import pandas as pd 
import numpy as np 
import mysql.connector as ms

In [6]:
mydb=ms.connect(host='localhost',user='root',passwd='Staners2020',database ='sakila')
if mydb.is_connected():
    print("Connection is successfull")

Connection is successfull

## 1.Show a list of 10 shortest-running comedies

In [9]:
mycursor= mydb.cursor()
mycursor.execute('''
select title, category, length from film_list
where category='Comedy'
order by length
limit 10;
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

              title category  length
0   DOWNHILL ENOUGH   Comedy      47
1    HEAVEN FREEDOM   Comedy      48
2  PARADISE SABRINA   Comedy      48
3  HURRICANE AFFAIR   Comedy      49
4         ZORRO ARK   Comedy      50
5        LION UNCUT   Comedy      50
6       CLOSER BANG   Comedy      58
7   AIRPLANE SIERRA   Comedy      62
8   LONELY ELEPHANT   Comedy      67
9      DOOM DANCING   Comedy      68

## 2.Show a complete list of movie categories along with the number of movies per category & the average DVD rental price of each category

In [12]:
mycursor= mydb.cursor()
mycursor.execute('''
select category.name as Category, avg(rental_rate) as averagPriceWa
from category, film
group by category
limit 10;
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

      Category averagPriceWa
0       Action      2.980000
1    Animation      2.980000
2     Children      2.980000
3     Classics      2.980000
4       Comedy      2.980000
5  Documentary      2.980000
6        Drama      2.980000
7       Family      2.980000
8      Foreign      2.980000
9        Games      2.980000

## 3.Show a list of the 10 actors/actresses who starred in the most movies. The columns shown are minimal: actor id, first name, last name and number of movies starring

In [15]:
mycursor= mydb.cursor()
mycursor.execute('''
select actor_id, first_name, last_name, count(film_id) as jumlah_movie
from actor join film_actor using (actor_id)
group by actor_id
order by jumlah_movie desc, actor_id desc
limit 10;
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

   actor_id first_name    last_name  jumlah_movie
0       107       GINA    DEGENERES            42
1       102     WALTER         TORN            41
2       198       MARY       KEITEL            40
3       181    MATTHEW       CARREY            39
4        23     SANDRA       KILMER            37
5        81   SCARLETT        DAMON            36
6       158     VIVIEN     BASINGER            35
7       144     ANGELA  WITHERSPOON            35
8       106    GROUCHO        DUNST            35
9        60      HENRY        BERRY            35

## 4.Show a list of movie categories along with the number of movies that have starred Gina Degeneres

In [27]:
mycursor= mydb.cursor()
mycursor.execute('''
select  first_name, count(film_id) as jumlah_movie
from actor join film_actor using (fisrt_name) 
group by actor_id
order by jumlah_movie desc, fisrt_name desc
limit 10;
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

ProgrammingError: 1054 (42S22): Unknown column 'fisrt_name' in 'from clause'